src/cf/MDM/InformationRegisters/_ЗаявкиВСлужбуНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>_ЗаявкиВСлужбуНСИ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._ЗаявкаВСлужбуНСИ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/MDM/Enums/_СтатусыЗаявокВСлужбуНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>_СтатусыЗаявокВСлужбуНСИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/MDM/CommonModules/_ПодпискиНаСобытия/Ext/Module.bsl
Процедура _ЗаявкиВСлужбуНСИПриПроведенииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.СтатусЗаявки=Перечисления._СтатусыЗаявокВСлужбуНСИ.Выполнена 
		ИЛИ Источник.СтатусЗаявки=Перечисления._СтатусыЗаявокВСлужбуНСИ.Отказ тогда
		
	  Попытка	
		ЗаписатьЗаявку=РегистрыСведений._ЗаявкиВСлужбуНСИ.СоздатьМенеджерЗаписи();
		ЗаписатьЗаявку.Заявка=Источник.Ссылка;
		ЗаписатьЗаявку.Отправлено=Ложь;
		ЗаписатьЗаявку.Записать();  
	  Исключение  
		ЗаписьЖурналаРегистрации("Данные.Изменение", 
        УровеньЖурналаРегистрации.Ошибка,
        Метаданные.РегистрыСведений._ЗаявкиВСлужбуНСИ,
        Источник,
        "Не удалось зарегистрировать к обмену"); 
	  КонецПопытки;	
	
	КонецЕсли;	
КонецПроцедуры
